In [ ]:
df.loc[행 인덱싱값]

In [ ]:
또는

In [ ]:
df.loc[행 인덱싱값, 열 인덱싱값]

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.arange(10, 22).reshape(3,4),
                 index=['a', 'b', 'c'],
                 columns=['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [3]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [4]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [6]:
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [7]:
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [ ]:
# df[["b", "c"]]     KeyError

In [8]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [9]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [10]:
def select_rows(df):
    return df.A > 15

In [11]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [12]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [13]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [14]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [18]:
df = pd.DataFrame(np.arange(10, 22).reshape(3,4),
                 index=['a', 'b', 'c'],
                 columns=['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [16]:
df.loc['a','A']

10

In [17]:
df.loc["b":, "A"]

b    14
c    18
Name: A, dtype: int32

In [19]:
df.loc["a",:]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [21]:
df.loc[["a","b"],["B","D"]]

    B   D
a  11  13
b  15  17

In [24]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [25]:
df.iloc[0, 1]

11

In [26]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [27]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [28]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [29]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [32]:
df.iloc[-1] = df.iloc[-1]*2
df

     A    B    C    D
a   10   11   12   13
b   14   15   16   17
c  144  152  160  168